In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
from scipy import optimize

In [2]:
pd.Series([1, 2, 3, 4])

0    1
1    2
2    3
3    4
dtype: int64

In [3]:
pd.date_range("20210306", periods=7)

DatetimeIndex(['2021-03-06', '2021-03-07', '2021-03-08', '2021-03-09',
               '2021-03-10', '2021-03-11', '2021-03-12'],
              dtype='datetime64[ns]', freq='D')

In [7]:
pd.DataFrame(np.array([[1,2,3],[4,5,6]]), index=pd.date_range("20210306",periods=2),columns=list("ABC"))

            A  B  C
2021-03-06  1  2  3
2021-03-07  4  5  6

In [17]:
dt = pd.DataFrame({
    "A": np.array([1, 2, 3]),
    "B": pd.Timestamp("2021-03-06"),
    "C": pd.Categorical(["car", "bus", "bike"]),
    "D": 1.5
})
dt

   A          B     C    D
0  1 2021-03-06   car  1.5
1  2 2021-03-06   bus  1.5
2  3 2021-03-06  bike  1.5

In [18]:
dt.head()

   A          B     C    D
0  1 2021-03-06   car  1.5
1  2 2021-03-06   bus  1.5
2  3 2021-03-06  bike  1.5

In [19]:
dt.tail(2)

   A          B     C    D
1  2 2021-03-06   bus  1.5
2  3 2021-03-06  bike  1.5

In [21]:
dt['B']

0   2021-03-06
1   2021-03-06
2   2021-03-06
Name: B, dtype: datetime64[ns]

In [22]:
dt[1:2]

   A          B    C    D
1  2 2021-03-06  bus  1.5

In [25]:
dt['C'] == 'car'

0     True
1    False
2    False
Name: C, dtype: bool

In [26]:
dt[dt['C'] == 'car']

   A          B    C    D
0  1 2021-03-06  car  1.5

In [27]:
q = pd.DataFrame(index=range(0, 10), columns=['x', 'y'])
q.loc[3] = [20, 30]
q

     x    y
0  NaN  NaN
1  NaN  NaN
2  NaN  NaN
3   20   30
4  NaN  NaN
5  NaN  NaN
6  NaN  NaN
7  NaN  NaN
8  NaN  NaN
9  NaN  NaN